In [5]:
import numpy as np

In [6]:
import pandas as pd

In [7]:
from pandas import Series,DataFrame

In [8]:
from numpy.random import randn

# Group by Type1 : Group by on the basis of two columns

In [5]:
a=DataFrame({'Dataset1':np.random.randn(5),'Dataset2':np.random.randn(5),'K1':['x','x','y','y','z'],'K2':['alpha','beta','alpha','beta','alpha']})

In [6]:
a

   Dataset1  Dataset2 K1     K2
0 -0.532452  0.161471  x  alpha
1 -1.948405  0.693854  x   beta
2 -0.291224 -0.432623  y  alpha
3 -0.020741  1.560895  y   beta
4 -0.653679 -0.191056  z  alpha

In [14]:
group1=a['Dataset1'].groupby(a['K1'])

In [18]:
group1

In [29]:
#always use group with aggregate function (sum,count,avg)

In [30]:
group1.sum()

K1
x    0.649394
y    1.706862
z   -1.063255
Name: Dataset1, dtype: float64

In [86]:
group2=a['Dataset1'].groupby(a['K2'])

In [87]:
group2

In [1]:
group2.sum()

NameError: name 'group2' is not defined

# Type 2 : Group by on the basis of single columns of DataFrame

In [90]:
a.groupby('K1').mean()         #we are grouping the whole database

    Dataset1  Dataset2
K1
x   0.324697 -0.829331
y   0.853431  0.123010
z  -1.063255 -1.232245

In [7]:
a.groupby('K2').mean()

       Dataset1  Dataset2
K2
alpha -0.492452 -0.154069
beta  -0.984573  1.127374

In [8]:
a.groupby('K1').count()

    Dataset1  Dataset2  K2
K1
x          2         2   2
y          2         2   2
z          1         1   1

In [9]:
a.groupby('K2').count()

       Dataset1  Dataset2  K1
K2
alpha         3         3   3
beta          2         2   2

In [11]:
a.groupby('K1').sum()

    Dataset1  Dataset2
K1
x  -2.480858  0.855324
y  -0.311965  1.128272
z  -0.653679 -0.191056

In [13]:
a.groupby('K1').sum()

    Dataset1  Dataset2
K1
x  -2.480858  0.855324
y  -0.311965  1.128272
z  -0.653679 -0.191056

# Type 3 : Group by on the basis of DataFrame Array

In [14]:
Cities=np.array(['NY','LA','LA','NY','NY'])

In [15]:
month=np.array(['JAN','FEB','JAN','FEB','JAN'])

In [16]:
a['Dataset2'].groupby([Cities]).sum()

LA    0.261231
NY    1.531310
Name: Dataset2, dtype: float64

In [17]:
a['Dataset2'].groupby([Cities,month]).sum()

LA  FEB    0.693854
    JAN   -0.432623
NY  FEB    1.560895
    JAN   -0.029585
Name: Dataset2, dtype: float64

In [18]:
a['Dataset2'].groupby([month,Cities]).sum()

FEB  LA    0.693854
     NY    1.560895
JAN  LA   -0.432623
     NY   -0.029585
Name: Dataset2, dtype: float64

In [20]:
a['Dataset2'].groupby([Cities]).count()

LA    2
NY    3
Name: Dataset2, dtype: int64

In [21]:
a.groupby([Cities]).sum()

    Dataset1  Dataset2
LA -2.239629  0.261231
NY -1.206872  1.531310

In [25]:
a['Dataset2'].groupby([Cities,month]).mean()

LA  FEB    0.693854
    JAN   -0.432623
NY  FEB    1.560895
    JAN   -0.014793
Name: Dataset2, dtype: float64

# Type 4 : Group by on the basis of two catagorical column

In [21]:
b=DataFrame({'Name':['abc','xyz','xyz'],'Age':[14,12,11],'Percentage':[65,87,91]})

In [22]:
b

  Name  Age  Percentage
0  abc   14          65
1  xyz   12          87
2  xyz   11          91

In [26]:
Section =['Sec A','Sec A','Sec C']

In [83]:
Class = ['Cl 8','Cl 9','Cl 9']

# Type 5 : Group by on the basis of dictionary and dataframe

In [91]:
c=DataFrame(np.arange(16).reshape(4,4),index=['dog','cat','cow','tiger'],columns=['w','x','y','z'])

In [92]:
c

        w   x   y   z
dog     0   1   2   3
cat     4   5   6   7
cow     8   9  10  11
tiger  12  13  14  15

In [74]:
b={'w':'Good','x':'Bad','y':'Good','z':'Bad'}

In [75]:
b

{'w': 'Good', 'x': 'Bad', 'y': 'Good', 'z': 'Bad'}

In [76]:
c.loc['cat']

w    4
x    5
y    6
z    7
Name: cat, dtype: int64

In [93]:
c.iloc[1,0]='NaN'

In [94]:
c.iloc[1,2]='NaN'

In [95]:
c

         w   x    y   z
dog      0   1    2   3
cat    NaN   5  NaN   7
cow      8   9   10  11
tiger   12  13   14  15

In [96]:
c.groupby(b,axis=1).sum()

       Bad    Good
dog      4       2
cat     12  NaNNaN
cow     20      18
tiger   28      26

In [97]:
c.groupby(b,axis=1).count()

       Bad  Good
dog      2     2
cat      2     2
cow      2     2
tiger    2     2

In [98]:
c.groupby(b,axis=1).mean()

/opt/anaconda3/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3444: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  exec(code_obj, self.user_global_ns, self.user_ns)

        Bad  Good
dog     2.0   1.0
cow    10.0   9.0
tiger  14.0  13.0

In [100]:
c.iloc[1,0]=np.nan

In [102]:
c.iloc[1,2]=np.nan

In [103]:
c

         w   x    y   z
dog      0   1    2   3
cat    NaN   5  NaN   7
cow      8   9   10  11
tiger   12  13   14  15

In [104]:
c.groupby(b,axis=1).sum()

       Bad  Good
dog      4     2
cat     12     0
cow     20    18
tiger   28    26

In [105]:
c.groupby(b,axis=1).mean()

        Bad  Good
dog     2.0   1.0
cat     6.0   NaN
cow    10.0   9.0
tiger  14.0  13.0

In [106]:
c.groupby(b,axis=1).count()

       Bad  Good
dog      2     2
cat      2     0
cow      2     2
tiger    2     2

In [3]:
a=[np.nan,np.nan]

NameError: name 'np' is not defined

In [4]:
b=pd.series(a)

NameError: name 'pd' is not defined